# ตัวดำเนินการเปรี่ยบเทียบ

# นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
# ค่าที่นำมาเปรียบเทีนยจะต้องเป็นชนิดข้อมูลเดียวกัน
# คำตอบที่ได้ จะเป็น จริง / เท็จ

x,y = 10,5 # เป็นการรวมการกำหนดตัวแปร บรรทัดเดียวโดยใช้ , 

print("ค่า x มากกว่าค่า y หรือไม่ :" , x>y)
print("ค่า x น้อยกว่าค่า y หรือไม่ :" , x<y)
print("ค่า x เท่ากับค่า y หรือไม่ :" , x==y)
print("ค่า x ไม่เท่ากับค่า y หรือไม่ :" , x!=y)

print("ค่า x มากกว่า หรือ เท่ากับค่า y หรือไม่ :" , x>=y)
print("ค่า x น้อยกว่า หรือ เท่ากับค่า y หรือไม่ :" , x<=y)